In [1]:
import pandas as pd
import numpy as np

In [3]:
book_df = pd.read_csv('book (1).csv')

In [4]:
book_df[0:5]

,Unnamed: 0,User.ID,Book.Title,Book.Rating
0,1,276726,Classical Mythology,5
1,2,276729,Clara Callan,3
2,3,276729,Decision in Normandy,6
3,4,276736,Flu: The Story of the Great Influenza Pandemic...,8
4,5,276737,The Mummies of Urumchi,6

In [18]:
book_df.shape

(10000, 4)

In [19]:
book_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   10000 non-null  int64
 1   User.ID      10000 non-null  int64
 2   Book.Title   10000 non-null  object
 3   Book.Rating  10000 non-null  int64
dtypes: int64(3), object(1)
memory usage: 312.6+ KB

In [20]:
book_df.shape

(10000, 4)

In [21]:
book_df.describe()

        Unnamed: 0        User.ID  Book.Rating
count  10000.00000   10000.000000  10000.00000
mean    5000.50000   95321.249800      7.56630
std     2886.89568  117645.703609      1.82152
min        1.00000       8.000000      1.00000
25%     2500.75000    2103.000000      7.00000
50%     5000.50000    3757.000000      8.00000
75%     7500.25000  162052.000000      9.00000
max    10000.00000  278854.000000     10.00000

In [22]:
book_df.isnull().sum()

Unnamed: 0     0
User.ID        0
Book.Title     0
Book.Rating    0
dtype: int64

In [26]:
#number of unique users in the dataset
len(book_df["Book.Title"].unique())

9659

In [27]:
len(book_df["Book.Rating"].unique())

10

In [31]:
book_df

,Unnamed: 0,User.ID,Book.Title,Book.Rating
0,1,276726,Classical Mythology,5
1,2,276729,Clara Callan,3
2,3,276729,Decision in Normandy,6
3,4,276736,Flu: The Story of the Great Influenza Pandemic...,8
4,5,276737,The Mummies of Urumchi,6
...,...,...,...,...
9995,9996,162121,American Fried: Adventures of a Happy Eater.,7
9996,9997,162121,Cannibal In Manhattan,9
9997,9998,162121,How to Flirt: A Practical Guide,7
9998,9999,162121,Twilight,8
9999,10000,162129,Kids Say the Darndest Things,6

In [46]:
for col_name in book_df.columns:
    if(book_df[col_name].dtype == 'object'):
        book_df[col_name]= book_df[col_name].astype('category')
        book_df[col_name] =book_df[col_name].cat.codes

In [47]:
#Impute those NaNs with 0 values
book_df.fillna(0, inplace=True)

In [48]:
book_df

      Unnamed: 0  User.ID  Book.Title  Book.Rating
0              1   276726        1443            5
1              2   276729        1440            3
2              3   276729        1883            6
3              4   276736        2722            8
4              5   276737        7969            6
...          ...      ...         ...          ...
9995        9996   162121         517            7
9996        9997   162121        1220            9
9997        9998   162121        3377            7
9998        9999   162121        9019            8
9999       10000   162129        3870            6

[10000 rows x 4 columns]

In [49]:
#Calculating Cosine Similarity between Users
from sklearn.metrics import pairwise_distances
from scipy.spatial.distance import cosine, correlation

In [50]:
sim = 1 - pairwise_distances( book_df.values,metric='cosine')

In [51]:
sim

array([[1.        , 1.        , 0.99999874, ..., 0.99798321, 0.99684412,
        0.99793095],
       [1.        , 1.        , 0.99999872, ..., 0.99798326, 0.99684379,
        0.99793097],
       [0.99999874, 0.99999872, 1.        , ..., 0.99800717, 0.99692318,
        0.99795973],
       ...,
       [0.99798321, 0.99798326, 0.99800717, ..., 1.        , 0.99939867,
        0.9999954 ],
       [0.99684412, 0.99684379, 0.99692318, ..., 0.99939867, 1.        ,
        0.99949922],
       [0.99793095, 0.99793097, 0.99795973, ..., 0.9999954 , 0.99949922,
        1.        ]])

In [52]:
#Store the results in a dataframe
sim_df = pd.DataFrame(sim)

In [59]:
sim_df.iloc[0:5, 0:5]

          0         1         2         3         4
0  1.000000  1.000000  0.999999  0.999989  0.999722
1  1.000000  1.000000  0.999999  0.999989  0.999722
2  0.999999  0.999999  1.000000  0.999995  0.999758
3  0.999989  0.999989  0.999995  1.000000  0.999820
4  0.999722  0.999722  0.999758  0.999820  1.000000

In [60]:
np.fill_diagonal(sim, 0)
sim_df.iloc[0:5, 0:5]

          0         1         2         3         4
0  0.000000  1.000000  0.999999  0.999989  0.999722
1  1.000000  0.000000  0.999999  0.999989  0.999722
2  0.999999  0.999999  0.000000  0.999995  0.999758
3  0.999989  0.999989  0.999995  0.000000  0.999820
4  0.999722  0.999722  0.999758  0.999820  0.000000

In [61]:
#Most Similar Users
sim_df.idxmax(axis=1)[0:5]

0     1
1     0
2    33
3    25
4    12
dtype: int64

In [63]:
book_df[(book_df['Book.Title']==6) | (book_df['Book.Rating']==168)]

      Unnamed: 0  User.ID  Book.Title  Book.Rating
3849        3850     1248           6           10